tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $!innerInlet/k;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $!innerInlet/k;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $!outerInlet/k;
    }

    outlet
    {
        $!outlet/k;
    }

    staticWalls
    {
        $!wall/k;
    }

    movingWalls
    {
        $staticWalls;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
